
//1)მომხმარებელი შემოიტანს რიცხვს, თუ ის იქნება უარყოფითი რიცხვი უნდა დაგვიბრუნოს უარყოფითი რიცხვი, თუ ის იქნება დადებითი, დაგვიბრუნოს უარყოფითი რიცხვი,ყველა შემთხვევაში უნდა დაგვიბრუნოს უარყოფითი რიცხვი გარდა ნულისა;
// let num = prompt('Enter your number')

// if(num <= 0){
//     console.log(num)
// }else{
//     console.log(num * -1)
// }


//2)მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ დაბეჭდეთ მომხმარებლის შემოტანილ რიცხვამდე ყველა რიცხვის ჯამი

let num = prompt('Enter Your Number')

let sum = 0
for(let i = 0;i < num; i++){
    sum +=i
}
console.log(sum)